In [1]:
import pandas as pd

In [ ]:
df.head()

In [3]:
#using df.drop: to delete the coloumns

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass  Gender   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
#to delete and target in 2 teps

inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#to separate the data 

dummies = pd.get_dummies(inputs.Gender)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
#to combine the data
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass  Gender   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop(['Gender','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [11]:
#using sklearn i.e used for spliting

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [12]:
#GaussianNB: another name of Naive=_Bay's thm (in python)

from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [13]:
model.fit(X_train,y_train)

GaussianNB()

In [14]:
model.score(X_test,y_test)

0.7985074626865671

In [15]:
X_test[0:10]

     Pclass        Age     Fare  female
493       1  71.000000  49.5042       0
699       3  42.000000   7.6500       0
227       3  20.500000   7.2500       0
752       3  33.000000   9.5000       0
414       3  44.000000   7.9250       0
552       3  29.699118   7.8292       0
619       2  26.000000  10.5000       0
244       3  30.000000   7.2250       0
423       3  28.000000  14.4000       1
321       3  27.000000   7.8958       0

In [16]:
y_test[0:10]

493    0
699    0
227    0
752    0
414    1
552    0
619    0
244    0
423    0
321    0
Name: Survived, dtype: int64

In [17]:
model.predict(X_test[0:10])

array([0, 0, 0, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

In [18]:
model.predict_proba(X_test[:10])

array([[0.51753543, 0.48246457],
       [0.95852039, 0.04147961],
       [0.95386366, 0.04613634],
       [0.95902194, 0.04097806],
       [0.95813808, 0.04186192],
       [0.95808408, 0.04191592],
       [0.90558664, 0.09441336],
       [0.95803937, 0.04196063],
       [0.38238792, 0.61761208],
       [0.95725655, 0.04274345]])